package com.huateng.p3.account.common.enummodel;


import com.google.common.base.Objects;

public enum BussErrorCode {

    ERROR_CODE_000000("000000", "交易成功"),

    ERROR_CODE_200001("200001", "客户资料已存在"),

    ERROR_CODE_200002("200002", "客户已开通资金帐户"),

    ERROR_CODE_200012("200012", "客户已开通积分帐户"),

    ERROR_CODE_200003("200003", "卡号已开户"),

    ERROR_CODE_200004("200004", "亲，卡号不存在"),

    ERROR_CODE_200005("200005", "亲，卡状态异常"),

    ERROR_CODE_200006("200006", "亲，绑定卡个数超限"),

    ERROR_CODE_200007("200007", "亲，账户状态异常"),

    ERROR_CODE_200008("200008", "亲，通信设备已被停机或拆机"),

    ERROR_CODE_200009("200009", "亲，帐户尚有余额不允许销户"),

    ERROR_CODE_200010("200010", "亲，客户不存在"),

    ERROR_CODE_200011("200011", "亲，客户状态异常"),

    ERROR_CODE_200013("200013", "亲，帐户不存在或未绑定帐户"),

    ERROR_CODE_200014("200014", "亲，客户不支持该交易"),

    ERROR_CODE_200015("200015", "亲，账户或卡已过期"),

    ERROR_CODE_200016("200016", "亲，客户黑名单"),

    ERROR_CODE_200017("200017", "亲，开户地区和城市不能为空"),

    ERROR_CODE_200018("200018", "亲，帐户未完成交易，不允许销户"),

    ERROR_CODE_200019("200019", "亲，帐户余额超限"),

    ERROR_CODE_200020("200020", "亲，帐户可用余额不足"),

    ERROR_CODE_200021("200021", "亲，交易金额非法"),

    ERROR_CODE_200029("200029", "亲，账户延期次数超限"),
    ERROR_CODE_200041("200041", "亲，不能重复冲正"),
    ERROR_CODE_200069("200069", "不能挂失代金券账户"),

    ERROR_CODE_200101("200101", "亲，单笔充值金额非法，单笔充值限额为#元"),

    ERROR_CODE_200102("200102", "亲，超过当日充值次数，当日充值次数为#次"),
    ERROR_CODE_200103("200103", "亲，超过当日累计充值金额，当日累计充值限额为#元"),
    ERROR_CODE_200104("200104", "亲，单笔消费金额非法，单笔消费限额为#元"),
    ERROR_CODE_200105("200105", "亲，超过当日消费次数，当日消费次数为#次"),
    ERROR_CODE_200106("200106", "亲，超过当日累计消费金额，当日累计消费限额为#元"),
    ERROR_CODE_200107("200107", "亲，单笔转入金额非法，单笔转入限额为#元"),
    ERROR_CODE_200108("200108", "亲，超过当日转入次数，当日转入次数为#次"),
    ERROR_CODE_200109("200109", "亲，超过当日累计转入金额，当日累计转入限额为#元"),
    ERROR_CODE_200110("200110", "亲，单笔转出金额非法，单笔转出限额为#元"),
    ERROR_CODE_200111("200111", "亲，超过当日转出次数，当日转出次数为#次"),
    ERROR_CODE_200112("200112", "亲，超过当日累计转出金额，当日累计转出限额为#元"),
    ERROR_CODE_200113("200113", "亲，超过当月累计消费金额，当月累计消费限额为#元"),
    ERROR_CODE_200114("200114", "亲，超过当月累计转出金额，当月累计转出限额为#元"),
    ERROR_CODE_200115("200115", "亲，超过当月累计转入金额，当月累计转入限额为#元"),
    ERROR_CODE_200116("200116", "亲，超过当月累计提现金额，当月累计提现限额为#元"),
    ERROR_CODE_200117("200117", "亲，超过当月累计充值金额，当月累计充值限额为#元"),
    ERROR_CODE_200118("200118", "亲，单笔提现金额非法，单笔提现限额为#元"),
    ERROR_CODE_200119("200119", "亲，超过当日提现次数，当日提现次数为#次"),
    ERROR_CODE_200120("200120", "亲，超过当日累计提现金额，当日累计提现限额为#元"),
    ERROR_CODE_200121("200121", "亲，超过当月累计消费次数，当月累计消费次数为#次"),
    ERROR_CODE_200122("200122", "亲，超过当月累计转出次数，当月累计转出次数为#次"),
    ERROR_CODE_200123("200123", "亲，超过当月累计转入次数，当月累计转入次数为#次"),
    ERROR_CODE_200124("200124", "亲，超过当月累计提现次数，当月累计提现次数为#次"),
    ERROR_CODE_200125("200125", "亲，超过当月累计充值次数，当月累计充值次数为#次"),
    ERROR_CODE_200126("200126", "亲，金额超过账户可提现额度"),
    /**
     * 黑名单
     */
    ERROR_CODE_200150("200150", "银行卡黑名单"),
    ERROR_CODE_200151("200151", "身份证黑名单"),
    ERROR_CODE_200160("200160", "亲，指定交易超过日限额，当日累计限额为#元"),
    ERROR_CODE_200161("200161", "亲，指定交易超过月限额，当月累计限额为#元"),
    ERROR_CODE_200162("200162", "亲，指定交易超过日次数，当日累计次数为#次"),
    ERROR_CODE_200163("200163", "亲，指定交易超过月次数，当月累计次数为#次"),
    ERROR_CODE_200164("200164", "亲，指定交易单笔金额非法，单笔限额为#元"),
    /**
     * 交易密码错
     */
    ERROR_CODE_200022("200022", "亲，支付密码错，您还剩#次尝试机会"),

    ERROR_CODE_200023("200023", "亲，您的支付密码错误次数超限被锁定，请在#后再进行交易"),

    ERROR_CODE_200024("200024", "亲，非法区号"),

    ERROR_CODE_200025("200025", "亲，非法手机号"),

    ERROR_CODE_200026("200026", "亲，账户属地不能为空"),

    ERROR_CODE_200027("200027", "亲，账户禁止此交易"),

    /**
     * 撤销金额与原交易不符
     */
    ERROR_CODE_200030("200030", "亲，撤销金额与原交易不符"),//
    /**
     * 撤销帐号与原交易不符
     */
    ERROR_CODE_200031("200031", "亲，撤销帐号与原交易不符"),//

    ERROR_CODE_200038("200038", "亲，客户信息不匹配"),//

    /**
     * 商户终端不匹配         校验密码
     */
    ERROR_CODE_200032("200032", "亲，商户终端不匹配"),

    ERROR_CODE_200034("200034", "用户未开通指定产品"),
    
    ERROR_CODE_200035("200035", "用户已关闭此业务功能"),

    /**
     * 账户关键数据密文报文不一致
     */
    ERROR_CODE_200040("200040", "亲，账户数据非法"),

    ERROR_CODE_200042("200042", "新旧密码不能相同"),

    ERROR_CODE_200051("200051", "非同一客户的脱机账户和资金账户之间不能圈存圈提"),

    ERROR_CODE_200052("200052", "亲，非法账户类型"),

    ERROR_CODE_200054("200054", "亲，非法账户标示"),

    /**
     * 不能重复撤销
     */
    ERROR_CODE_200080("200080", "亲，不能重复撤销"),
    /**
     * 原交易不存在，不允许撤销
     */
    ERROR_CODE_200081("200081", "亲，原交易不存在，不允许撤销"),
    /**
     * 撤销交易代码和原交易代码不符
     */
    ERROR_CODE_200082("200082", "亲，撤销交易代码和原交易代码不符"),
    /**
     * 原记录已冲正，不允许撤销
     */
    ERROR_CODE_200083("200083", "亲，原记录已冲正，不允许撤销"),
    /**
     * 原记录已撤销，不允许冲正
     */
    ERROR_CODE_200084("200084", "亲，原记录已撤销，不允许冲正"),

    ERROR_CODE_200085("200085", "亲，消费代金券不存在"),

    ERROR_CODE_200086("200086", "亲，冲正金额和原金额不一致"),

    ERROR_CODE_200087("200087", "亲，冲正账号和原交易账号不一致"),

    ERROR_CODE_200090("200090", "子账户不存在"),
    
    ERROR_CODE_200130("200130", "主账户不存在"),

    ERROR_CODE_200132("200132", "登录密码错"),

    ERROR_CODE_200136("200136", "解析照片出错"),

    ERROR_CODE_200137("200137", "非实名账户"),

    ERROR_CODE_200139("200139", "此证件号码认证的用户数超限"),

    ERROR_CODE_200140("200140", "上次申请未审核，不能进行本次申请"),

    ERROR_CODE_200156("200156", "用户所属省份未开通号码支付功能"),

    ERROR_CODE_200157("200157", "该等级用户未开通号码支付功能"),

    ERROR_CODE_210007("210007", "亲，卡片有效期失效或卡号不存在"),

    ERROR_CODE_210008("210008", "卡初识信息不匹配"),

    ERROR_CODE_220006("220006", "商户不存在"),

    ERROR_CODE_220007("220007", "商户状态非正常"),

    ERROR_CODE_220008("220008", "商户黑名单"),

    ERROR_CODE_220009("220009", "商户或机构错误"),

    ERROR_CODE_220022("220022", "商户日累计交易消费额超限"),

    ERROR_CODE_220024("220024", "商户或机构不能受理此业务"),

    ERROR_CODE_220025("220025", "商户单笔交易消费额超限"),

    ERROR_CODE_220026("220026", "该地区已关闭空中圈存功能"),

    ERROR_CODE_230006("230006","登记类型非电信手机"),
    ERROR_CODE_230004("230004","银行卡号非法"),
    ERROR_CODE_230001("230001","银行卡卡号已被绑定"),
    ERROR_CODE_230002("230002","超过最多绑定数量"),
    ERROR_CODE_230003("230003","没有绑定的银行卡"),
    
    ERROR_CODE_240001("240001","该手机已被绑定"),
    ERROR_CODE_240002("240002","手机号非法"),
    ERROR_CODE_240003("240003","客户已绑定手机"),
    
    
    ERROR_CODE_300000("300000", "原预授权记录不存在，不能完成授权"),
    ERROR_CODE_300001("300001", "原预授权记录已撤销，不能完成授权"),
    ERROR_CODE_300002("300002", "原预授权记录已冲正，不能完成授权"),
    ERROR_CODE_300003("300003", "预授权完成金额超过预授权申请金额"),
    ERROR_CODE_300004("300004", "预授权已超期，不能完成授权"),
    ERROR_CODE_300005("300005", "原预授权记录已完成，不能重复完成授权"),
    
    ERROR_CODE_410002("410002", "原消费交易不存在，不能退货"),
    ERROR_CODE_410003("410003", "原消费交易已冲正，不能退货"),
    ERROR_CODE_410004("410004", "原消费交易已撤销，不能退货"),
    ERROR_CODE_410005("410005", "总退货金额超出原消费金额"),    
    ERROR_CODE_410006("410006", "商户或机构不允许全部退货"),
    ERROR_CODE_410007("410007", "商户或机构不允许部分退货"),
    ERROR_CODE_410008("410008", "商户或机构不允许多次退货"),
    ERROR_CODE_410009("410009", "商户或机构无退货规则，不能退货"),    
    ERROR_CODE_410010("410010", "原消费交易已挂账，不能退货"),

    /**
     * 自定义错误码
     */
    ERROR_CODE_500001("500001", "日消费交易最大次数不能超过#次"),
    ERROR_CODE_500002("500002", "日消费交易单笔限额上限不能超过#元"),
    ERROR_CODE_500003("500003", "日消费交易累计限额上限不能超过#元"),
    ERROR_CODE_500004("500004", "日消费交易单笔最小额不能低于#元"),
    ERROR_CODE_500005("500005", "日充值交易最大次数不能超过#次"),
    ERROR_CODE_500006("500006", "日充值交易单笔限额上限不能超过#元"),
    ERROR_CODE_500007("500007", "日充值交易单笔最小额不能低于#元"),
    ERROR_CODE_500008("500008", "日充值交易累计限额上限不能超过#元"),
    ERROR_CODE_500009("500009", "日提现交易最大次数不能超过#次"),
    ERROR_CODE_500010("500010", "日提现交易单笔限额上限不能超过#元"),
    ERROR_CODE_500011("500011", "日提现交易单笔最小额不能低于#元"),
    ERROR_CODE_500012("500012", "日提现交易累计限额上限不能超过#元"),
    ERROR_CODE_500013("500013", "日转账交易最大次数不能超过#次"),
    ERROR_CODE_500014("500014", "日转账交易单笔限额上限不能超过#元"),
    ERROR_CODE_500015("500015", "日转账交易单笔最小额不能低于#元"),
    ERROR_CODE_500016("500016", "日转账交易累计限额上限不能超过#元"),
    ERROR_CODE_500017("500017", "月累计消费次数不能超过#次"),
    ERROR_CODE_500018("500018", "月累计消费限额上限不能超过#元"),
    ERROR_CODE_500019("500019", "月累计转出次数不能超过#次"),
    ERROR_CODE_500020("500020", "月累计转出限额上限不能超过#元"),
    ERROR_CODE_500021("500021", "月累计转入次数不能超过#次"),
    ERROR_CODE_500022("500022", "月累计转入限额上限不能超过#元"),
    ERROR_CODE_500023("500023", "月累计提现次数不能超过#次"),
    ERROR_CODE_500024("500024", "月累计提现限额上限不能超过#元"),
    ERROR_CODE_500025("500025", "月累计充值次数不能超过#次"),
    ERROR_CODE_500026("500026", "月累计充值限额上限不能超过#元"),
    ERROR_CODE_500030("500030", "亲，快捷消费金额与充值不符"),
    ERROR_CODE_500031("500031", "亲，快捷消费机构与充值不符"),
    ERROR_CODE_500032("500032", "亲，冲正金额与原交易不符"),
    ERROR_CODE_500033("500033", "亲，冲正帐号与原交易不符"),
    ERROR_CODE_500051("500051", "亲，销户当日不能重新开户"),
    ERROR_CODE_500100("500100", "查询参数非法"),
    ERROR_CODE_500101("500101", "查无记录"),
    ERROR_CODE_500102("500102", "产品属性已开通"),
    ERROR_CODE_500103("500103", "申请已审核，不能重复申请"),
    ERROR_CODE_500104("500104", "绑卡记录不唯一"),
    ERROR_CODE_500105("500105", "绑定银行卡不能超过三张"),
    ERROR_CODE_500106("500106", "此卡已经绑定，不能重复绑卡"),
    ERROR_CODE_500107("500107", "绑卡姓名与客户姓名不一致"),
    ERROR_CODE_500108("500108", "绑卡身份证与客户姓名不一致"),
    ERROR_CODE_500200("500200", "账户状态不为正常或挂失，不能冻结"),
    ERROR_CODE_500201("500201", "账户状态不为冻结，不能解冻"),
    ERROR_CODE_500202("500202", "账户状态不为正常、冻结或挂失，不能锁定"),
    ERROR_CODE_500203("500203", "账户状态不为锁定，不能解锁"),
    ERROR_CODE_500204("500204", "短信参数非法"),
    ERROR_CODE_500205("500205", "渠道参数非法"),
    ERROR_CODE_500206("500206", "非法密保问题或答案"),
    ERROR_CODE_500207("500207", "内容不能为空"),
    
    
    ERROR_CODE_700001("700001", "用户名或密码错误"),
    ERROR_CODE_700023("700023", "登录密码不正确，今日再输错#次，账户将被锁定。 "),
    ERROR_CODE_700012("700012", "由于您密码输入错误达到上限,您的账户已锁定,#将自动解锁。"),
    ERROR_CODE_700014("700014", "您的账户状态异常"),

    ERROR_CODE_700017("700017", "无法匹配清结算规则"),




    
    ERROR_CODE_900000("900000", "数据加密失败"),


    /**
     * 非法交易类型
     */
    ERROR_CODE_900001("900001", "非法交易类型"),

    /**
     * 数据存在多个值
     */
    ERROR_CODE_900005("900005", "非法数据"),

    /**
     * 数据资源忙 *
     */
    ERROR_CODE_900006("900006", "资源忙"),

    /**
     * /** 数据唯一性冲突
     */
    ERROR_CODE_900003("900003", "非法数据"),

    /**
     * 数据错误
     */
    ERROR_CODE_900007("900007", "非法数据"),

    /**
     * 数据错误
     */
    ERROR_CODE_910000("910000", "数据错误"),

    /**
     * 未知错误
     */
    ERROR_CODE_999999("999999", "系统忙");

    private String errorcode;

    public String getErrorcode() {
        return errorcode;
    }

    public String getErrordesc() {
        return errordesc;
    }

    private String errordesc;

    BussErrorCode(String errorcode, String errordesc) {
        this.errorcode = errorcode;
        this.errordesc = errordesc;
    }

    public static String explain(String errorCode) {
        for (BussErrorCode bussErrorCode : BussErrorCode.values()) {
            if (Objects.equal(errorCode, bussErrorCode.errorcode)) {
                return bussErrorCode.errordesc;
            }
        }
        return errorCode;
    }

    // public final static String ERROR_CODE_900000 = "900000";// 数据加密失败

}
